angular.module('app').factory('contentData', ['$rootScope', function($rootScope){
	var obj = {
		content: {

			tourTitle: {
				ua: '" 10 родзинок Закарпаття "',
				ru: '" 10 изюминок Закарпатья "'
			},
			tourSlogan: {
				ua: 'Відчуйте на собі магію Закарпаття і пориньте в особливу атмосферу мальовничого регіону України!',
				ru: 'Почувствуйте на себе магию Закарпатья и окунитесь в особенную атмосферу живописного региона Украины!'
			},
			buyTourBtn: {
				ua: 'В тур!',
				ru: 'В тур!'
			},
			moreBtn: {
				ua: 'Дізнатись більше',
				ru: 'Узнать больше'
			},

			menuItem: {
				i1: {
					ua: 'Головна',
					ru: 'Главная'
				},
				i2: {
					ua: 'Деталі',
					ru: 'Подробности'
				},
				i3: {
					ua: 'Вартість',
					ru: 'Стоимость'
				},
				i4: {
					ua: 'Замовити',
					ru: 'Заказать'
				}
			},

			detail: {
				s1: {
					title: {
						ua: 'Тривалість туру',
						ru: 'Длительность тура'
					},
					days: {
						ua: '3 дні',
						ru: '3 дня'
					},
					nights: {
						ua: '2 ночі',
						ru: '2 ночи'
					}
				}
			},

			price : {

			}

		}
	};

	return obj;
}]);